CSI API ETABS v1
cCaseModalRitz.GetLoads Method
 This function retrieves the load data for the specified load case.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetLoads(
	string Name,
	ref int NumberLoads,
	ref string[] LoadType,
	ref string[] LoadName,
	ref int[] RitzMaxCyc,
	ref double[] TargetPar
)
Function GetLoads (
	Name As String,
	ByRef NumberLoads As Integer,
	ByRef LoadType As String(),
	ByRef LoadName As String(),
	ByRef RitzMaxCyc As Integer(),
	ByRef TargetPar As Double()
) As Integer
Dim instance As cCaseModalRitz
Dim Name As String
Dim NumberLoads As Integer
Dim LoadType As String()
Dim LoadName As String()
Dim RitzMaxCyc As Integer()
Dim TargetPar As Double()
Dim returnValue As Integer
returnValue = instance.GetLoads(Name,
	NumberLoads, LoadType, LoadName,
	RitzMaxCyc, TargetPar)
int GetLoads(
	String^ Name,
	int% NumberLoads,
	array<String^>^% LoadType,
	array<String^>^% LoadName,
	array<int>^% RitzMaxCyc,
	array<double>^% TargetPar
)
abstract GetLoads :
        Name : string *
        NumberLoads : int byref *
        LoadType : string[] byref *
        LoadName : string[] byref *
        RitzMaxCyc : int[] byref *
        TargetPar : float[] byref -> int
Parameters
Name
Type: System.String
 The name of an existing modal Ritz load case.
NumberLoads
Type: System.Int32
 The number of loads assigned to the specified analysis case.
LoadType
Type: System.String[]
 This is an array that includes Load, Accel or Link, indicating the type of each load assigned to the load case.
LoadName
Type: System.String[]
 This is an array that includes the name of each load assigned to the load case. If the LoadType item is Load, this item is the name of a defined load pattern. If the LoadType item is Accel, this item is UX, UY, UZ, RX, RY or RZ, indicating the direction of the load. If the LoadType item is Link, this item is not used.
RitzMaxCyc
Type: System.Int32[]
 This is an array that includes the maximum number of generation cycles to be performed for the specified ritz starting vector. A value of 0 means there is no limit on the number of cycles.
TargetPar
Type: System.Double[]
 This is an array that includes the target mass participation ratio.
Return Value
Type: Int32
 The function returns zero if the data is successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim InitialCase As String
   Dim MyLoadType() As String
   Dim MyLoadName() As String
   Dim MyRitzMaxCyc() As Integer
   Dim MyTargetPar() As Double
   Dim NumberLoads As Integer
   Dim LoadType() As String
   Dim LoadName() As String
   Dim RitzMaxCyc() As Integer
   Dim TargetPar() As Double
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
    ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'add modal Ritz load case
    ret = SapModel.LoadCases.ModalRitz.SetCase("LCASE1")
'set load data
   ReDim MyLoadType(2)
   ReDim MyLoadName(2)
   ReDim MyRitzMaxCyc(2)
   ReDim MyTargetPar(2)
   MyLoadType(0) = "Load"
   MyLoadName(0) = "DEAD"
   MyRitzMaxCyc(0) = 0
   MyTargetPar(0) = 99
   MyLoadType(1) = "Accel"
   MyLoadName(1) = "UZ"
   MyRitzMaxCyc(1) = 0
   MyTargetPar(1) = 99
   MyLoadType(2) = "Link"
   MyRitzMaxCyc(2) = 0
   MyTargetPar(2) = 99
   ret = mySapModel.LoadCases.ModalRitz.SetLoads("LCASE1", 3, MyLoadType, MyLoadName, MyRitzMaxCyc, MyTargetPar)
'get load data
   ret = mySapModel.LoadCases.ModalRitz.GetLoads("LCASE1", NumberLoads, LoadType, LoadName, RitzMaxCyc, TargetPar)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cCaseModalRitz Interface
ETABSv1 Namespace